In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv("sample_data.csv")

In [3]:
data

      Name  Gender       City Passed
0     Aman    Male      Delhi    Yes
1    Priya  Female     Mumbai    Yes
2    Rahul    Male  Bangalore     No
3   Anjali  Female     Mumbai    Yes
4     Ravi    Male      Delhi    Yes
5    Meera  Female    Chennai     No
6    Arjun    Male  Bangalore    Yes
7     Neha  Female      Delhi    Yes
8    Imran    Male    Chennai     No
9    Sneha  Female     Mumbai    Yes
10     Raj    Male    Chennai    Yes
11   Divya  Female      Delhi     No
12   Kabir    Male     Mumbai    Yes
13  Simran  Female  Bangalore    Yes
14   Karan    Male      Delhi     No
15   Pooja  Female     Mumbai    Yes
16  Rakesh    Male    Chennai    Yes
17    Isha  Female      Delhi     No
18   Rohit    Male      Delhi    Yes
19   Deepa  Female  Bangalore    Yes

In [5]:
data.isnull().sum()  ## This will conferm that there is no Blank and NA value in the dataset

Name      0
Gender    0
City      0
Passed    0
dtype: int64

# ENCODING CATOGORIAL VALUE

In [7]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()     #(LabelEncoding)

In [16]:
data["Gender_encoded"]=le.fit_transform(data["Gender"])
data["Passed_encoded"]=le.fit_transform(data["Passed"])

In [18]:
data   ## With this we have encoded the Gender Column (LabelEncoding)

      Name  Gender       City Passed  Gender_encoded  Passed_encoded
0     Aman    Male      Delhi    Yes               1               1
1    Priya  Female     Mumbai    Yes               0               1
2    Rahul    Male  Bangalore     No               1               0
3   Anjali  Female     Mumbai    Yes               0               1
4     Ravi    Male      Delhi    Yes               1               1
5    Meera  Female    Chennai     No               0               0
6    Arjun    Male  Bangalore    Yes               1               1
7     Neha  Female      Delhi    Yes               0               1
8    Imran    Male    Chennai     No               1               0
9    Sneha  Female     Mumbai    Yes               0               1
10     Raj    Male    Chennai    Yes               1               1
11   Divya  Female      Delhi     No               0               0
12   Kabir    Male     Mumbai    Yes               1               1
13  Simran  Female  Bangalore    Yes               0               1
14   Karan    Male      Delhi     No               1               0
15   Pooja  Female     Mumbai    Yes               0               1
16  Rakesh    Male    Chennai    Yes               1               1
17    Isha  Female      Delhi     No               0               0
18   Rohit    Male      Delhi    Yes               1               1
19   Deepa  Female  Bangalore    Yes               0               1

In [22]:
## One-Hot Encoding
data_encoded=pd.get_dummies(data,columns=["City"], dtype=int)

In [23]:
data_encoded

,Name,Gender,Passed,Gender_encoded,Passed_encoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,Male,Yes,1,1,0,0,1,0
1,Priya,Female,Yes,0,1,0,0,0,1
2,Rahul,Male,No,1,0,1,0,0,0
3,Anjali,Female,Yes,0,1,0,0,0,1
4,Ravi,Male,Yes,1,1,0,0,1,0
5,Meera,Female,No,0,0,0,1,0,0
6,Arjun,Male,Yes,1,1,1,0,0,0
7,Neha,Female,Yes,0,1,0,0,1,0
8,Imran,Male,No,1,0,0,1,0,0
9,Sneha,Female,Yes,0,1,0,0,0,1
10,Raj,Male,Yes,1,1,0,1,0,0
11,Divya,Female,No,0,0,0,0,1,0
12,Kabir,Male,Yes,1,1,0,0,0,1
13,Simran,Female,Yes,0,1,1,0,0,0
14,Karan,Male,No,1,0,0,0,1,0
15,Pooja,Female,Yes,0,1,0,0,0,1
16,Rakesh,Male,Yes,1,1,0,1,0,0
17,Isha,Female,No,0,0,0,0,1,0
18,Rohit,Male,Yes,1,1,0,0,1,0
19,Deepa,Female,Yes,0,1,1,0,0,0

In [27]:
data_encoded[["Name", "Gender_encoded","Passed_encoded","City_Bangalore","City_Chennai","City_Delhi","City_Mumbai"]]

,Name,Gender_encoded,Passed_encoded,City_Bangalore,City_Chennai,City_Delhi,City_Mumbai
0,Aman,1,1,0,0,1,0
1,Priya,0,1,0,0,0,1
2,Rahul,1,0,1,0,0,0
3,Anjali,0,1,0,0,0,1
4,Ravi,1,1,0,0,1,0
5,Meera,0,0,0,1,0,0
6,Arjun,1,1,1,0,0,0
7,Neha,0,1,0,0,1,0
8,Imran,1,0,0,1,0,0
9,Sneha,0,1,0,0,0,1
10,Raj,1,1,0,1,0,0
11,Divya,0,0,0,0,1,0
12,Kabir,1,1,0,0,0,1
13,Simran,0,1,1,0,0,0
14,Karan,1,0,0,0,1,0
15,Pooja,0,1,0,0,0,1
16,Rakesh,1,1,0,1,0,0
17,Isha,0,0,0,0,1,0
18,Rohit,1,1,0,0,1,0
19,Deepa,0,1,1,0,0,0

In [32]:
X=data_encoded[["Gender_encoded","City_Bangalore","City_Chennai","City_Delhi","City_Mumbai"]]
y=data_encoded[["Passed_encoded"]]

In [33]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=42)

In [34]:
X_train

    Gender_encoded  City_Bangalore  City_Chennai  City_Delhi  City_Mumbai
8                1               0             1           0            0
5                0               0             1           0            0
11               0               0             0           1            0
3                0               0             0           0            1
18               1               0             0           1            0
16               1               0             1           0            0
13               0               1             0           0            0
2                1               1             0           0            0
9                0               0             0           0            1
19               0               1             0           0            0
4                1               0             0           1            0
12               1               0             0           0            1
7                0               0             0           1            0
10               1               0             1           0            0
14               1               0             0           1            0
6                1               1             0           0            0

In [35]:
y_train

    Passed_encoded
8                0
5                0
11               0
3                1
18               1
16               1
13               1
2                0
9                1
19               1
4                1
12               1
7                1
10               1
14               0
6                1

In [36]:
X_test

    Gender_encoded  City_Bangalore  City_Chennai  City_Delhi  City_Mumbai
0                1               0             0           1            0
17               0               0             0           1            0
15               0               0             0           0            1
1                0               0             0           0            1

In [37]:
y_test

    Passed_encoded
0                1
17               0
15               1
1                1